src/Documents/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетнаяПолитика</name>
  <registerRecords>InformationRegister.УчетнаяПолитика</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>СпособСписанияЗапасов</name>
    <type>
      <types>EnumRef.СпособыСписанияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособУчетаЗапасов</name>
    <type>
      <types>EnumRef.СпособыСписанияЗапасов</types>
    </type>
  </resources>
</mdclass:InformationRegister>

src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/СпособыСписанияЗапасов/СпособыСписанияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСписанияЗапасов</name>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
  <enumValues>
    <name>FEFO</name>
  </enumValues>
</mdclass:Enum>

src/Documents/УчетнаяПолитика/ObjectModule.bsl
// Модуль объекта документа "УчетнаяПолитика".
// Выполняет две ключевые функции:
//   1. Записывает выбранный способ списания запасов (FEFO или По средней) в регистр сведений "УчетнаяПолитика".
//   2. При переходе на метод "По средней" выполняет преобразование партионных остатков:
//      списывает все текущие остатки с указанием сроков годности и сразу же приходует
//      их обратно без срока годности, тем самым объединяя партии в единый остаток.

// Обработчик проведения документа.
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // 1. Запись способа учета запасов в регистр сведений "УчетнаяПолитика".
    Движения.УчетнаяПолитика.Записывать = Истина;
    Движение = Движения.УчетнаяПолитика.Добавить();
    Движение.Период = Дата;
    Движение.СпособУчетаЗапасов = СпособСписанияЗапасов;
    
    // 2. Если выбран способ "По средней" – выполняем пересчет партионных остатков.
    Если СпособСписанияЗапасов = Перечисления.СпособыСписанияЗапасов.ПоСредней Тогда
        
        Движения.ТоварыНаСкладах.Записывать = Истина;
        Движения.ТоварыНаСкладах.Записать();   // очистим старые движения, если есть
        
        // Блокировка всего регистра "ТоварыНаСкладах" на время выполнения операции.
        // Используется исключительная блокировка, чтобы другие сеансы не могли
        // читать или изменять остатки, пока идет преобразование.
        Блокировка = Новый БлокировкаДанных;
        ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
        Блокировка.Заблокировать();
        
        // Запрос: получить все текущие остатки (в разрезе номенклатуры, склада и срока годности)
        // на момент проведения документа.
        Запрос = Новый Запрос;
        Запрос.Текст =
        "ВЫБРАТЬ
        |    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
        |    ТоварыНаСкладахОстатки.Склад КАК Склад,
        |    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
        |    ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
        |    ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
        |ИЗ
        |    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки";
        
        Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));
        Выборка = Запрос.Выполнить().Выбрать();
        
        // Обработка каждого остатка: списываем старую партию (с указанием срока годности)
        // и приходуем такое же количество, но без срока годности.
        Пока Выборка.Следующий() Цикл
            // Расход: списание существующей партии с её сроком годности.
            ДвижениеРасход = Движения.ТоварыНаСкладах.ДобавитьРасход();
            ДвижениеРасход.Период = Дата;
            ЗаполнитьЗначенияСвойств(ДвижениеРасход, Выборка);
            
            // Приход: поступление того же товара/количества/суммы, но без срока годности.
            ДвижениеПриход = Движения.ТоварыНаСкладах.ДобавитьПриход();
            ДвижениеПриход.Период = Дата;
            ЗаполнитьЗначенияСвойств(ДвижениеПриход, Выборка, , "СрокГодности"); // пропускаем СрокГодности
        КонецЦикла;
        
    КонецЕсли;
    
КонецПроцедуры
